const figureOfCat = [
	"🐈",
	"🐈‍⬛"
];

const meowOfCat0 = [
    "",
    "う",
    "ぅ",
    "お",
    "ぉ",
    "む",
    "ん",
    "ゔ",
    "ぅ゛",
    "お゛",
    "ぉ゛",
    "ぶ"
];

const meowOfCat1 = [
    "あ",
    "ぁ",
    "ぃぁ",
    "ぃや",
    "ぃゃ",
    "な",
    "にぁ",
    "にゃ",
    "ぬぁ",
    "ぬゃ",
    "ま",
    "みぁ",
    "みゃ",
    "や",
    "ゃ",
    "わ",
    "ゎ",
    "あ゛",
    "ぁ゛",
    "な゛",
    "に゛ぁ",
    "に゛ゃ",
    "ま゛",
    "み゛ぁ",
    "み゛ゃ",
    "わ゛",
    "ゎ゛",
];

const meowOfCat2 = [
    "ー",
    "〜",
    "あ",
    "ぁ",
    "う",
    "ぅ",
    "お",
    "ぉ"
];

const meowOfCat3 = [
    "",
    "っ",
    "ー",
    "〜",
    "あ",
    "ぁ",
    "う",
    "ぅ",
    "お",
    "ぉ",
    "む",
    "ん",
    "…",
    "？",
    "!"

];

const meowOfCat4 = [
	"にゃーん",
	"うなーお",
	"なむなむ",
	"カッカッカッ",
	"フシャーッ",
	"うるるるる…",
	"ごあーん",
	"ぎゃぅ",
	"んみゃあ",
	"んぅー",
	"ひぁー",
	"みゃおう",
	"にゃっにゃっ",
	"ま゛ぅぅ",
	"ゎあーーん",
    "ンギャォォォォォ",
    "ふすー…ふすー…",
    "フンフンフンフン",
    "ごろごろごろ…",
    "ちゃむちゃむ",
    "ゔゔゔゔゔゔ",
    "ぴゃああぅ",
    "ィ゛ヤァァォゥ",
    "ぅわんぅわん",
    "おわああああん"
];

